---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ElementsAreDisconnected
source: html/6a32da5a-940b-c872-f468-62fe61bdab93.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ElementsAreDisconnected Property

Elements need to be disconnected.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsAreDisconnected { get; }
```